{
  "title": "Решение квадратного линейного уравнения",
  "description": "Программа для решения квадратного уравнения на программируемых калькуляторах так же традиционна, как вывод "Hello, World" в учебниках по Си. И это неспроста. Нахождение корней алгебраических уравнений - типичная задача обработки числовых данных, не требующая больших вычислительных ресурсов",
  "code": [
    "ИПВ Fx2 4 ИПА ИПС × × - F√ ПD",
    "ИПВ - 2 ИПА × П3 ÷ ИПВ ИПD +",
    "/-/ ИП3 ÷ С/П"
  ],
  "bytes": [
    "6b 22 04 6a 6c 12 12 11 21 4d",
    "6b 11 02 6a 12 43 13 6b 6d 10",
    "0b 63 13 50"
  ],
  "instruction": [{
    "text": "Для вычисления корней следует ввести в RA, RB, RC коэффициенты. Нажать клавиши "В/О" и "С/П"."
  }, {
    "text": "Если уравнение не имеет действительных корней, то после попытки нахождения квадратного корня из отрицательного числа возникнет ошибка и будет выведено сообщение "ERROR"."
    "position": 9
  }, {
    "text": "После останова в регистрах стека X и Y будут корни уравнения."
    "position": 23
  }],
  "url": "http://mk.semico.ru/dr_info4.htm",
  "tests": [{
    "name": "2x^2 + 14x + 24 = 0, x1 = -12, x2 = -2",
    "steps": [{
      "in": "02 4a",
      "out": "2.",
    }, {
      "in": "01 04 4b",
      "out": "14."
    }, {
      "in": "02 04 4c",
      "out": "24."
    }, {
      "in": "52 50",
      "out": "-12."
    }, {
      "in": "14",
      "out": "-2."
    }]
  }, {
    "name": "2x^2 + 6 = 0, Корней нет",
    "steps": [{
      "in": "02 4a",
      "out": "2.",
    }, {
      "in": "00 4b",
      "out": "0."
    }, {
      "in": "06 4c",
      "out": "6."
    }, {
      "in": "52 50",
      "out": "Error"
    }]
  }]
}
