{
  "title": "Решение квадратного линейного уравнения",
  "description": "Программа для решения квадратного уравнения на программируемых калькуляторах так же традиционна, как вывод "Hello, World" в учебниках по Си. И это неспроста. Нахождение корней алгебраических уравнений - типичная задача обработки числовых данных, не требующая больших вычислительных ресурсов",
  "code": [
    "ИПВ	Fx2	4	ИПА	×	ИПС	×	-	ПD	ИПВ",
    "/-/	ИПD	F√	+	2	ИПА	×	÷	ИПВ	/-/",
    "ИПD	F√	+	2	ИПА	×	÷	С/П""
  ],
  "instruction": [{
    "text": "Для вычисления корней следует ввести в RA, RB, RC коэффициенты. Нажать клавиши "В/О" и "С/П"."
  }, {
    "text": "Если уравнение не имеет действительных корней, то после попытки нахождения квадратного корня из отрицательного числа возникнет ошибка и будет выведено сообщение "ERROR"."
    "position": 12
  }, {
    "text": "После останова в регистрах стека X и Y будут корни уравнения."
    "position": 27
  }],
  "url": "http://mk.semico.ru/dr_info4.htm"
}
